uat_chat/InformationRegisters/ЗимниеПериоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЗимниеПериоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ЗимниеПериоды/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Зап из ЭтотОбъект Цикл
		Если Зап.ДатаНачала >= Зап.ДатаОкончания Тогда
			Сообщить("Дата начала зимнего периода "+Зап.ДатаНачала+" больше даты окнчания "+Зап.ДатаОкончания);
			Отказ = Истина;
		КонецеСЛИ;
	КонецЦиклА;
		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗимниеПериоды.ДатаНачала КАК ДатаНачала,
	               |	ЗимниеПериоды.ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.ЗимниеПериоды КАК ЗимниеПериоды
	               |
	               |УПОРЯДОЧИТЬ ПО
				   |	ДатаНачала";
				   Тбл = Запрос.Выполнить().Выгрузить();
				   Для а=1 по Тбл.Количество()-1 Цикл
					   Стр = Тбл[а];
					   Если Тбл[а].ДатаНачала <= Тбл[а-1].ДатаОкончания Тогда
						 Сообщить("Дата начала зимнего периода "+Тбл[а].ДатаНачала+" меньше даты окончания предыдущего "+Тбл[а-1].ДатаОкончания);  
						 Отказ = Истина;
					   КонецЕсли;
				   КонецЦиклА;
				   
	КонецПроцедуры
